tutorials/coupled/conjugateHeatSimpleFoam/conjugateCavity/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            buoyantPressure;
        rho             rhok;
    }

    left
    {
        type            buoyantPressure;
        rho             rhok;
    }

    right
    {
        type            buoyantPressure;
        rho             rhok;
    }

    bottom
    {
        type            buoyantPressure;
        rho             rhok;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
